package model; // הגדרת החבילה שבה נמצא הקובץ - מודל המשחק

/**
 * אינאם המייצג את סוגי הנמלים השונים במשחק קטאן
 */
public enum PortType {
    GENERIC_3_1, // נמל כללי המאפשר החלפה של 3 משאבים זהים תמורת 1 אחר מכל סוג
    WOOD_2_1,    // נמל עץ המאפשר החלפה של 2 יחידות עץ תמורת משאב 1 אחר מכל סוג
    BRICK_2_1,   // נמל לבנים המאפשר החלפה של 2 יחידות לבנים תמורת משאב 1 אחר מכל סוג
    SHEEP_2_1,   // נמל כבשים המאפשר החלפה של 2 יחידות צמר תמורת משאב 1 אחר מכל סוג
    WHEAT_2_1,   // נמל חיטה המאפשר החלפה של 2 יחידות חיטה תמורת משאב 1 אחר מכל סוג
    ORE_2_1      // נמל ברזל המאפשר החלפה של 2 יחידות ברזל תמורת משאב 1 אחר מכל סוג
}
