package model; // הגדרת החבילה שבה נמצא הקובץ - מודל המשחק

/**
 * אינאם המייצג את סוגי המשאבים השונים במשחק קטאן
 */
public enum ResourceType {
    WOOD,   // משאב עץ - משמש לבניית דרכים ויישובים
    BRICK,  // משאב לבנה - משמש לבניית דרכים ויישובים
    SHEEP,  // משאב צמר (כבשה) - משמש לבניית יישובים וקניית קלפי פיתוח
    WHEAT,  // משאב חיטה - משמש לבניית יישובים, ערים וקניית קלפי פיתוח
    ORE,    // משאב עפרה (ברזל) - משמש לבניית ערים וקניית קלפי פיתוח
    NONE;    // מייצג חוסר משאב, למשל במקרה של משבצת מדבר

    /**
     * פונקציה המחזירה את שם המשאב בעברית.
     * [יעילות: O(1)] - זמן ריצה קבוע.
     * @return מחרוזת המייצגת את שם המשאב בעברית.
     */
    public String toHebrew() {
        if (this == WOOD) return "עץ";
        if (this == BRICK) return "לבנה";
        if (this == SHEEP) return "כבשה";
        if (this == WHEAT) return "חיטה";
        if (this == ORE) return "עפרה";
        return "ללא";
    }
}
